#### 📖 Terraform Plan ('src/common/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
data.azurerm_linux_function_app.eucovidcert: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_04: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_sign_user: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.app_messages_xl[1]: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_04: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [20s elapsed]
data.azurerm_linux_function_app.app_messages_xl[0]: Still reading... [10s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_profile[0]: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_profile[1]: Still reading... [10s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [10s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_selfcare_be: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_profile[0]: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_profile[1]: Still reading... [20s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [20s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.apim_itn.azurerm_key_vault_access_policy.apim_v2_kv_policy will be created
  + resource "azurerm_key_vault_access_policy" "apim_v2_kv_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = []
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-kv"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.apim_itn.azurerm_key_vault_access_policy.v2_common will be created
  + resource "azurerm_key_vault_access_policy" "v2_common" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = []
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.apim_itn.azurerm_network_security_group.apim will be created
  + resource "azurerm_network_security_group" "apim" {
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-apim-nsg-01"
      + resource_group_name = "io-p-itn-common-rg-01"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "3443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "managementapim"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "ApiManagement"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
      + tags                = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
    }

  # module.apim_itn.azurerm_public_ip.apim will be created
  + resource "azurerm_public_ip" "apim" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + domain_name_label       = "apimio"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "italynorth"
      + name                    = "io-p-itn-apim-pip-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + zones                   = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.apim_itn.azurerm_subnet.apim will be created
  + resource "azurerm_subnet" "apim" {
      + address_prefixes                               = [
          + "10.20.100.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-p-itn-apim-snet-01"
      + private_endpoint_network_policies              = "Enabled"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "io-p-itn-common-rg-01"
      + service_endpoints                              = [
          + "Microsoft.Web",
        ]
      + virtual_network_name                           = "io-p-itn-common-vnet-01"
    }

  # module.apim_itn.azurerm_subnet_network_security_group_association.apim will be created
  + resource "azurerm_subnet_network_security_group_association" "apim" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "api_app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-waf-appgateway-api-app-policy"
        name                = "io-p-waf-appgateway-api-app-policy"
        tags                = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.monitoring_weu.azurerm_application_insights_standard_web_test.web_tests["CIE"] will be destroyed
  # (because key ["CIE"] is not in for_each map)
  - resource "azurerm_application_insights_standard_web_test" "web_tests" {
      - application_insights_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common" -> null
      - enabled                 = true -> null
      - frequency               = 900 -> null
      - geo_locations           = [
          - "emea-nl-ams-azr",
        ] -> null
      - id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/webTests/CIE-test-io-p-ai-common" -> null
      - location                = "westeurope" -> null
      - name                    = "CIE-test-io-p-ai-common" -> null
      - resource_group_name     = "io-p-rg-common" -> null
      - retry_enabled           = true -> null
      - synthetic_monitor_id    = "CIE-test-io-p-ai-common" -> null
      - tags                    = {} -> null
      - timeout                 = 30 -> null
        # (1 unchanged attribute hidden)

      - request {
          - follow_redirects_enabled         = false -> null
          - http_verb                        = "GET" -> null
          - parse_dependent_requests_enabled = false -> null
          - url                              = "https://app-backend.io.italia.it/login?authLevel=SpidL2&entityID=xx_servizicie" -> null
            # (1 unchanged attribute hidden)
        }

      - validation_rules {
          - expected_status_code        = 200 -> null
          - ssl_cert_remaining_lifetime = 1 -> null
          - ssl_check_enabled           = true -> null
        }
    }

  # module.monitoring_weu.azurerm_application_insights_standard_web_test.web_tests["CIE L2"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common"
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "westeurope"
      + name                    = "CIE L2-test-io-p-ai-common"
      + resource_group_name     = "io-p-rg-common"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://app-backend.io.italia.it/login?authLevel=SpidL2&entityID=xx_servizicie"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 1
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_weu.azurerm_application_insights_standard_web_test.web_tests["CIE L3"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common"
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "westeurope"
      + name                    = "CIE L3-test-io-p-ai-common"
      + resource_group_name     = "io-p-rg-common"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://app-backend.io.italia.it/login?authLevel=SpidL3&entityID=xx_servizicie"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 1
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_weu.azurerm_monitor_metric_alert.metric_alerts["CIE"] will be destroyed
  # (because key ["CIE"] is not in for_each map)
  - resource "azurerm_monitor_metric_alert" "metric_alerts" {
      - auto_mitigate            = false -> null
      - description              = "Web availability check alert triggered when it fails. Runbook: https://pagopa.atlassian.net/wiki/spaces/IC/pages/762347521/Web+Availability+Test+-+TLS+Probe+Check" -> null
      - enabled                  = true -> null
      - frequency                = "PT1M" -> null
      - id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/metricAlerts/CIE-test-io-p-ai-common" -> null
      - name                     = "CIE-test-io-p-ai-common" -> null
      - resource_group_name      = "io-p-rg-common" -> null
      - scopes                   = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common",
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/webTests/CIE-test-io-p-ai-common",
        ] -> null
      - severity                 = 1 -> null
      - tags                     = {} -> null
      - window_size              = "PT5M" -> null
        # (2 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror" -> null
          - webhook_properties = {} -> null
        }

      - application_insights_web_test_location_availability_criteria {
          - component_id          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common" -> null
          - failed_location_count = 1 -> null
          - web_test_id           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/webTests/CIE-test-io-p-ai-common" -> null
        }
    }

  # module.monitoring_weu.azurerm_monitor_metric_alert.metric_alerts["CIE L2"] will be created
  + resource "azurerm_monitor_metric_alert" "metric_alerts" {
      + auto_mitigate            = false
      + description              = "Web availability check alert triggered when it fails. Runbook: https://pagopa.atlassian.net/wiki/spaces/IC/pages/762347521/Web+Availability+Test+-+TLS+Probe+Check"
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "CIE L2-test-io-p-ai-common"
      + resource_group_name      = "io-p-rg-common"
      + scopes                   = (known after apply)
      + severity                 = 1
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + application_insights_web_test_location_availability_criteria {
          + component_id          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common"
          + failed_location_count = 1
          + web_test_id           = (known after apply)
        }
    }

  # module.monitoring_weu.azurerm_monitor_metric_alert.metric_alerts["CIE L3"] will be created
  + resource "azurerm_monitor_metric_alert" "metric_alerts" {
      + auto_mitigate            = false
      + description              = "Web availability check alert triggered when it fails. Runbook: https://pagopa.atlassian.net/wiki/spaces/IC/pages/762347521/Web+Availability+Test+-+TLS+Probe+Check"
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "CIE L3-test-io-p-ai-common"
      + resource_group_name      = "io-p-rg-common"
      + scopes                   = (known after apply)
      + severity                 = 1
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + application_insights_web_test_location_availability_criteria {
          + component_id          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common"
          + failed_location_count = 1
          + web_test_id           = (known after apply)
        }
    }

  # module.apim_itn.module.apim_v2.azurerm_api_management.this will be created
  + resource "azurerm_api_management" "this" {
      + client_certificate_enabled    = false
      + developer_portal_url          = (known after apply)
      + gateway_disabled              = false
      + gateway_regional_url          = (known after apply)
      + gateway_url                   = (known after apply)
      + id                            = (known after apply)
      + location                      = "italynorth"
      + management_api_url            = (known after apply)
      + name                          = "io-p-itn-apim-01"
      + notification_sender_email     = (sensitive value)
      + policy                        = (known after apply)
      + portal_url                    = (known after apply)
      + private_ip_addresses          = (known after apply)
      + public_ip_addresses           = (known after apply)
      + public_network_access_enabled = true
      + publisher_email               = (sensitive value)
      + publisher_name                = "IO"
      + resource_group_name           = "io-p-itn-common-rg-01"
      + scm_url                       = (known after apply)
      + sku_name                      = "Developer_1"
      + tags                          = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + virtual_network_type          = "Internal"

      + delegation (known after apply)

      + hostname_configuration (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + protocols (known after apply)

      + security (known after apply)

      + sign_in (known after apply)

      + sign_up (known after apply)

      + tenant_access (known after apply)

      + virtual_network_configuration {
          + subnet_id = (known after apply)
        }
    }

  # module.application_gateway_weu.module.app_gw.azurerm_application_gateway.this will be updated in-place
  ~ resource "azurerm_application_gateway" "this" {
        id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway"
        name                              = "io-p-appgateway"
        tags                              = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra"
        }
        # (8 unchanged attributes hidden)

      ~ autoscale_configuration {
          ~ min_capacity = 10 -> 20
            # (1 unchanged attribute hidden)
        }

        # (86 unchanged blocks hidden)
    }

Plan: 11 to add, 2 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app,
  on ../_modules/application_gateway/firewall.tf line 61, in resource "azurerm_web_application_firewall_policy" "api_app":
  61:         rule_group_name = "REQUEST-942-APPLICATION-ATTACK-SQLI"

`disabled_rules` will be removed in favour of the `rule` property in version
4.0 of the AzureRM Provider.

(and 53 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
